import math

#Просим пользователя ввести исходный радиус круга в см
Rsm = float(input('Введите радиус круга в сантиметрах - '))

#Задаём переменные для вычисления характеристик круга с помощью мат.формул
Csm = float(2 * math.pi * Rsm)
Ssm = float(math.pi * ( Rsm ** 2 ))

#Вычисляем значения площади и круга в метрах
Cm = float(Csm / 100)
Sm = float(Ssm / 10000)

#Выводим значения пользователю
print(f'Длина окружности - {Csm} (см) или {Cm} (м)')
print(f'Площадь круга - {Ssm} (см²) или {Sm} (м ²)')

#Задаём переменные для вычисления сторон вписанных четырёх- и треугольника с помощью мат.формул
Square_side_sm = float(Rsm * ( 2 ** 0.5))
Triangle_side_sm = float(Rsm * ( 3 ** 0.5))

#Выводим вычисленные значения 
print(f'Длина стороны ВПИСАННОГО квадрата - {Square_side_sm} (см) или {float(Square_side_sm / 100)} (м)')
print(f'Длина стороны ВПИСАННОГО треугольника - {Triangle_side_sm} (см) или {float(Triangle_side_sm / 100)} (м)')

#Задаём переменные для вычисления сторон описанных четырёх-, тре-, восьмиугольника с помощью мат.формул
Out_Sq_side_sm = float(Rsm * 2)
Out_Tri_side_sm = float(Rsm * 2 * ( 3 ** 0.5))
Out_Poli_side_sm = float(Rsm * 2 * math.tan( math.pi / 8))

#Выводим вычисленные значения 
print(f'Длина стороны ОПИСАННОГО квадрата - {Out_Sq_side_sm} (см) или {float(Out_Sq_side_sm / 100)} (м)')
print(f'Длина стороны ОПИСАННОГО треугольника - {Out_Tri_side_sm} (см) или {float(Out_Tri_side_sm / 100)} (м)')
print(f'Длина стороны ОПИСАННОГО восьмиугольника - {Out_Poli_side_sm} (см) или {float(Out_Poli_side_sm / 100)} (м)')


